In [17]:
import pandas as pd
import seaborn as sns

In [18]:
titanic = sns.load_dataset("titanic")

In [19]:
# Först - förstå datasetet

titanic.head()  # lämpligt för att titta på datan
                # För att veta vad de betyder - behöver gå till källan
                # och hitta förklaring

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
titanic.info()
# De som står object på är strängar i detta fall. 
# En sådan sak man kan titta på när man gör 
# Datacleaning. Om t.ex. fare varit object, hade vi velat konvertera till float.
# För att städa upp och lägga rätt datatyp. 
# Ibland har man importerat data och allt kommit in som strängar. 
# Non-null count: Hur många värden i kolumnen är inte NaN

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [21]:
titanic.isna()    # Alla som saknar värde blir true och annars false
titanic.isna().sum() # summerar för kolumnen: 1:a true och 0 false
# I detta fall t.ex. ta bort kolumn deck helt eftersom
# så mkt saknas, och ta bort de rader där bara 2 sakn as etc

titanic.isna().sum() / len(titanic) *100

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [22]:
titanic.isna().sum() / len(titanic) *100  # procent antal nullvärden

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

Viktigt att cleana datat för att maskininlärningsalgoritmen inte ska få konstiga resultat

In [23]:
titanic.describe()
# annat bra sätt för att få bra överblick och förstå datasetet
# Statistik data och kvartiler fås
    # Om man sorterar age från lägsta till högsta höjd:
    # 25 % av raderna ner är det värdet 20.125 på age, 
    # 100 % är maxvärdet
    # 75 % av alla ombord var 38 år eller yngre
    
    # Tar bara fram data för numeriska värden

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [24]:
titanic.describe(include=["object", "category"])  # Inkluderar då bara de som har object som datatyp
                                    # Category är speciell datatyp som pandas har och kan ta 
                                    # begränsat antal värden. T.ex. bara 0 eller 1. 
                                    # Top = "Mode", och antal av dessa är freq.

         sex embarked  class  who deck  embark_town alive
count    891      889    891  891  203          889   891
unique     2        3      3    3    7            3     2
top     male        S  Third  man    C  Southampton    no
freq     577      644    491  537   59          644   549

In [25]:
titanic.describe(include="all")
# blir dock rörigt, och man får NaN på de numeriska osv för data som ej passar in.

# Object = strängar eller mixed values
# Om det är kombination av datatyper blir object, eller alla andra typer av python objekt, även om det är konstigt

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [37]:
# titanic.astype("object").info() # sätter alla till object
titanic2 = titanic.astype({"fare": "object", "age":"object"}).info() # sätter de specifika kolumnerna till viss datatyp
# Har ingen inplace så man får ta det till ny variabel.
titanic2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    object
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    object
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), int64(4), object(7)
memory usage: 80.7+ KB

In [42]:
titanic.loc[0, "sex"] = "male"

titanic.head()

# I categorical datatyp har det redan bestämts
# vilka värden som kan antas, så jag bara ändra till ett av de värden man
# har bestämt att de får ha, annars får felmeddelande

# Hur får man ut vilka värden man kan sätta det till,

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [36]:
titanic["sex"].unique() # unika värden för den kolumnen

titanic["sex"].value_counts() # antal av varje värde i kolumnen

titanic["class"].unique() #  Säger vilka som får finnas
# alla behöver ej finnas i kolumnen

['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

In [43]:
titanic["sex"].unique()

# Här gjorde han något som gav cannot give
# Category tjej, kolla. 
# Att ha som category finns en del fördelar.
# Fördel: tar mindre minne, sparar bara en nyckel för värdena en gång. 
# När man skapar kategoridatatyper kan man dels säga vilka typer av kategorier vi ska ha
# Kan också säga att de ska vara sorterade i viss ordning.
# T.ex. unsorted för male female
# Men i class first, second och third
# för när vi sorterar gör den det i den ordning vi sätter och inte
# bokstavsordning.

array(['male', 'female'], dtype=object)

timme 3
innan lunchen missats. 
missar början pga samtal